# KeynoteParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..KeynoteParam Property
ParameterTypeId Class See Also
---
"Keynote"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId KeynoteParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KeynoteParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KeynoteParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace